package com.example.umtec_brian.buswaitingtime;

import java.util.Arrays;
import java.util.List;

class station {

    public static final String[] location = {
            "C690 蝴蝶谷大馬路總站",
            "M1 關閘總站",
            "M10 台山街市",
            "M111 昌明花園",
            "M132 十六浦",
            "M134 新馬路/華僑",
            "M137 內港客運碼頭",
            "M144 水坑尾/天神巷",
            "M16 提督馬路/雅廉訪",
            "M161 高美士/利澳",
            "M167 南灣大馬路/時代",
            "M170 殷皇子馬路",
            "M172 亞馬喇前地",
            "M184 河邊新街/街市",
            "M213 俾若翰街/快富樓",
            "M219 勞動節大馬路",
            "M222 看台街",
            "M224 永康街/麗華",
            "M239 外港碼頭",
            "M248 關閘東側上落客區",
            "M272 愉景花園",
            "M50 勞動節大馬路/廣華",
            "M88 高士德/賈伯樂",
            "M9 關閘廣場",
            "T308 氹仔電訊",
            "T326 柯維納馬路",
            "T342 高勵雅馬路",
            "T345 氹仔客運碼頭",
            "T356 澳門機場",
            "T365 排角/銀河",
            "T376 連貫公路/巴黎人",
            "T419 機場大馬路/永利皇宮",
            "T551 澳大/研究生宿舍",
            "T560 橫琴澳方口岸",
            "其它"
    };

    public static final String[] location_101x = {
            "M800 港珠澳大橋邊檢大樓",
            "M247 海上居",
            "M225 看台街/騎士馬路",
            "M21 青洲/嘉應花園",
            "M102 船澳街",
            "M127 海邊新街",
            "M108 俾若翰街/綠楊花園",
            "M171 中區/殷皇子馬路",
            "M8 巴波沙大馬路",
            "M800 港珠澳大橋邊檢大樓",
            "M55 東北大馬路/南澳",
            "T423 蓮花海濱大馬路/百老匯",
            "T422 蓮花海濱大馬路/銀河/2",
            "T402 泉澧花園",
            "M235 東北大馬路/保利達",
            "M242 友誼馬路/海港街",
            "M69 葡京酒店",
            "T355 蓮花路停車場",
            "M159 總統酒店",
            "T424 海濱圓形地/生態保護區"
    };

    public static final String[] location_hengqin = {
            "T560 橫琴澳方口岸",
    };

    public static final List<String> locationNeedCopy = Arrays.asList(
            "M10 台山街市","M132 十六浦","M134 新馬路/華僑","M172 亞馬喇前地",  "T308 氹仔電訊",
            "T560 橫琴澳方口岸"

    );

    //路線
    public static final String[] routeList = {
            "5", "9", "16", "25", "34", "51", "16S", "25AX", "25B", "25BS", "28C", "28CX", "51A", "51AS", "51X", "65", "5X", "5S", "9A", "AP1", "AP1X", "H3",
            "4", "4", "15", "15S", "15S", "15S1", "17", "17S", "17S1", "17T", "26", "32", "33", "37", "39", "72", "102X", "102XS", "15T", "1A", "26A",
            "26AT", "26S", "32T", "37T", "86T", "MT4", "MT4S","MT5",
            "2", "7", "12", "19", "22", "52", "52S", "56", "73", "101X", "101XS", "12T", "18A", "2A", "2AS", "6A", "6B", "73S", "H2", "MT3", "N1A",
            "N1B", "N2", "N3", "N3S", "N4", "N5", "N6",
            "10", "11", "18", "30", "35", "35S", "55", "59", "59S", "71", "71S", "60", "10B", "10X", "18B", "21A", "21AS", "21AT", "30X", "3A",
            "3AX", "3AS", "3BX", "3T", "H1",
            "1", "3", "8", "23", "27", "27S", "29", "36", "50", "28A", "28B", "31T", "3X", "50B",
            "88X", "701X", "701XS", "101", "102", "103X", "61"
    };

}